benchmark/results/run-20260430-090853/monolith-u20-concurrent-read-run2-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\Quan Hoang\Downloads\DuAnCntt\benchmark\k6\test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m01.0s/2m0s

running (0m02.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m02.0s/2m0s

running (0m03.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m03.0s/2m0s

running (0m04.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m04.0s/2m0s

running (0m05.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m05.0s/2m0s

running (0m06.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m06.0s/2m0s

running (0m07.0s), 20/20 VUs, 113 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m07.0s/2m0s

running (0m08.0s), 20/20 VUs, 131 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m08.0s/2m0s

running (0m09.0s), 20/20 VUs, 149 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m09.0s/2m0s

running (0m10.0s), 20/20 VUs, 169 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m10.0s/2m0s

running (0m11.0s), 20/20 VUs, 188 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m11.0s/2m0s

running (0m12.0s), 20/20 VUs, 206 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m12.0s/2m0s

running (0m13.0s), 20/20 VUs, 224 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m13.0s/2m0s

running (0m14.0s), 20/20 VUs, 241 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m14.0s/2m0s

running (0m15.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m15.0s/2m0s

running (0m16.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m16.0s/2m0s

running (0m17.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m17.0s/2m0s

running (0m18.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m18.0s/2m0s

running (0m19.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m19.0s/2m0s

running (0m20.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m20.0s/2m0s

running (0m21.0s), 20/20 VUs, 380 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m21.0s/2m0s

running (0m22.0s), 20/20 VUs, 400 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m22.0s/2m0s

running (0m23.0s), 20/20 VUs, 417 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m23.0s/2m0s

running (0m24.0s), 20/20 VUs, 437 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m24.0s/2m0s

running (0m25.0s), 20/20 VUs, 457 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  0m25.0s/2m0s

running (0m26.0s), 20/20 VUs, 475 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m26.0s/2m0s

running (0m27.0s), 20/20 VUs, 489 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m27.0s/2m0s

running (0m28.0s), 20/20 VUs, 509 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  0m28.0s/2m0s

running (0m29.0s), 20/20 VUs, 529 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  0m29.0s/2m0s

running (0m30.0s), 20/20 VUs, 549 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m30.0s/2m0s

running (0m31.0s), 20/20 VUs, 566 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  0m31.0s/2m0s

running (0m32.0s), 20/20 VUs, 584 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m32.0s/2m0s

running (0m33.0s), 20/20 VUs, 600 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m33.0s/2m0s

running (0m34.0s), 20/20 VUs, 620 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  0m34.0s/2m0s

running (0m35.0s), 20/20 VUs, 640 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  0m35.0s/2m0s

running (0m36.0s), 20/20 VUs, 660 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m36.0s/2m0s

running (0m37.0s), 20/20 VUs, 680 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  0m37.0s/2m0s

running (0m38.0s), 20/20 VUs, 700 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m38.0s/2m0s

running (0m39.0s), 20/20 VUs, 720 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m39.0s/2m0s

running (0m40.0s), 20/20 VUs, 737 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m40.0s/2m0s

running (0m41.0s), 20/20 VUs, 757 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  0m41.0s/2m0s

running (0m42.0s), 20/20 VUs, 774 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  0m42.0s/2m0s

running (0m43.0s), 20/20 VUs, 791 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  0m43.0s/2m0s

running (0m44.0s), 20/20 VUs, 809 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m44.0s/2m0s

running (0m45.0s), 20/20 VUs, 829 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m45.0s/2m0s

running (0m46.0s), 20/20 VUs, 849 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  0m46.0s/2m0s

running (0m47.0s), 20/20 VUs, 869 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  0m47.0s/2m0s

running (0m48.0s), 20/20 VUs, 884 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m48.0s/2m0s

running (0m49.0s), 20/20 VUs, 900 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  0m49.0s/2m0s

running (0m50.0s), 20/20 VUs, 920 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m50.0s/2m0s

running (0m51.0s), 20/20 VUs, 940 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m51.0s/2m0s

running (0m52.0s), 20/20 VUs, 960 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  0m52.0s/2m0s

running (0m53.0s), 20/20 VUs, 980 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  0m53.0s/2m0s

running (0m54.0s), 20/20 VUs, 1000 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  0m54.0s/2m0s

running (0m55.0s), 20/20 VUs, 1020 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  0m55.0s/2m0s

running (0m56.0s), 20/20 VUs, 1040 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m56.0s/2m0s

running (0m57.0s), 20/20 VUs, 1057 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m57.0s/2m0s

running (0m58.0s), 20/20 VUs, 1077 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m58.0s/2m0s

running (0m59.0s), 20/20 VUs, 1093 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  0m59.0s/2m0s

running (1m00.0s), 20/20 VUs, 1113 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  1m00.0s/2m0s

running (1m01.0s), 20/20 VUs, 1133 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  1m01.0s/2m0s

running (1m02.0s), 20/20 VUs, 1153 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  1m02.0s/2m0s

running (1m03.0s), 20/20 VUs, 1173 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  1m03.0s/2m0s

running (1m04.0s), 20/20 VUs, 1185 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  1m04.0s/2m0s

running (1m05.0s), 20/20 VUs, 1201 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  1m05.0s/2m0s

running (1m06.0s), 20/20 VUs, 1220 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  1m06.0s/2m0s

running (1m07.0s), 20/20 VUs, 1240 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  1m07.0s/2m0s

running (1m08.0s), 20/20 VUs, 1260 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  1m08.0s/2m0s

running (1m09.0s), 20/20 VUs, 1280 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  1m09.0s/2m0s

running (1m10.0s), 20/20 VUs, 1300 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  1m10.0s/2m0s

running (1m11.0s), 20/20 VUs, 1320 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  1m11.0s/2m0s

running (1m12.0s), 20/20 VUs, 1340 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  1m12.0s/2m0s

running (1m13.0s), 20/20 VUs, 1360 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  1m13.0s/2m0s

running (1m14.0s), 20/20 VUs, 1380 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  1m14.0s/2m0s

running (1m15.0s), 20/20 VUs, 1399 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  1m15.0s/2m0s

running (1m16.0s), 20/20 VUs, 1416 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  1m16.0s/2m0s

running (1m17.0s), 20/20 VUs, 1433 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  1m17.0s/2m0s

running (1m18.0s), 20/20 VUs, 1453 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  1m18.0s/2m0s

running (1m19.0s), 20/20 VUs, 1473 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  1m19.0s/2m0s

running (1m20.0s), 20/20 VUs, 1493 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  1m20.0s/2m0s

running (1m21.0s), 20/20 VUs, 1509 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  1m21.0s/2m0s

running (1m22.0s), 20/20 VUs, 1526 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  1m22.0s/2m0s

running (1m23.0s), 20/20 VUs, 1541 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  1m23.0s/2m0s

running (1m24.0s), 20/20 VUs, 1560 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  1m24.0s/2m0s

running (1m25.0s), 20/20 VUs, 1580 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  1m25.0s/2m0s

running (1m26.0s), 20/20 VUs, 1600 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  1m26.0s/2m0s

running (1m27.0s), 20/20 VUs, 1620 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  1m27.0s/2m0s

running (1m28.0s), 20/20 VUs, 1640 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  1m28.0s/2m0s

running (1m29.0s), 20/20 VUs, 1660 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  1m29.0s/2m0s

running (1m30.0s), 20/20 VUs, 1680 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  1m30.0s/2m0s

running (1m31.0s), 20/20 VUs, 1700 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  1m31.0s/2m0s

running (1m32.0s), 20/20 VUs, 1720 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  1m32.0s/2m0s

running (1m33.0s), 20/20 VUs, 1740 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  1m33.0s/2m0s

running (1m34.0s), 20/20 VUs, 1756 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  1m34.0s/2m0s

running (1m35.0s), 20/20 VUs, 1773 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  1m35.0s/2m0s

running (1m36.0s), 20/20 VUs, 1793 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  1m36.0s/2m0s

running (1m37.0s), 20/20 VUs, 1813 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  1m37.0s/2m0s

running (1m38.0s), 20/20 VUs, 1833 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  1m38.0s/2m0s

running (1m39.0s), 20/20 VUs, 1848 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  1m39.0s/2m0s

running (1m40.0s), 20/20 VUs, 1863 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  1m40.0s/2m0s

running (1m41.0s), 20/20 VUs, 1881 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  1m41.0s/2m0s

running (1m42.0s), 20/20 VUs, 1900 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  1m42.0s/2m0s

running (1m43.0s), 20/20 VUs, 1920 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  1m43.0s/2m0s

running (1m44.0s), 20/20 VUs, 1940 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  1m44.0s/2m0s

running (1m45.0s), 20/20 VUs, 1960 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  1m45.0s/2m0s

running (1m46.0s), 20/20 VUs, 1980 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  1m46.0s/2m0s

running (1m47.0s), 20/20 VUs, 2000 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  1m47.0s/2m0s

running (1m48.0s), 20/20 VUs, 2020 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  1m48.0s/2m0s

running (1m49.0s), 20/20 VUs, 2040 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  1m49.0s/2m0s

running (1m50.0s), 20/20 VUs, 2056 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  1m50.0s/2m0s

running (1m51.0s), 20/20 VUs, 2076 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  1m51.0s/2m0s

running (1m52.0s), 20/20 VUs, 2096 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  1m52.0s/2m0s

running (1m53.0s), 20/20 VUs, 2116 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  1m53.0s/2m0s

running (1m54.0s), 20/20 VUs, 2136 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  1m54.0s/2m0s

running (1m55.0s), 20/20 VUs, 2153 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  1m55.0s/2m0s

running (1m56.0s), 20/20 VUs, 2173 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  1m56.0s/2m0s

running (1m57.0s), 20/20 VUs, 2193 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  1m57.0s/2m0s

running (1m58.0s), 20/20 VUs, 2209 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  1m58.0s/2m0s

running (1m59.0s), 20/20 VUs, 2224 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  1m59.0s/2m0s

running (2m00.0s), 20/20 VUs, 2243 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  2m00.0s/2m0s

running (2m01.0s), 02/20 VUs, 2262 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  2m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=15.59ms med=13.5ms min=5.45ms max=143.7ms p(90)=22.79ms p(95)=28.22ms p(99)=54.24ms
      { expected_response:true }...: avg=15.59ms med=13.5ms min=5.45ms max=143.7ms p(90)=22.79ms p(95)=28.22ms p(99)=54.24ms
    http_req_failed................: 0.00%  0 out of 9056
    http_reqs......................: 9056   74.815267/s

    EXECUTION
    iteration_duration.............: avg=1.06s   med=1.05s  min=1.03s  max=1.34s   p(90)=1.08s   p(95)=1.1s    p(99)=1.2s   
    iterations.....................: 2264   18.703817/s
    vus............................: 2      min=2         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 6.1 MB 51 kB/s
    data_sent......................: 3.0 MB 25 kB/s



running (2m01.0s), 00/20 VUs, 2264 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s